Repository: syedfaisaljaved/myapp
Catalog: lib/l10n/app_*.arb
Languages: bn, hi, id, ur

# language_tr
source: English
bn: বাংলা
hi: हिंदी
id: Bahasa Indonesia
ur: اردو

# app_name_tr
source: Rakaat Tracker
bn: রাকাত ট্র্যাকার
hi: राकात ट्रैकर
id: Pelacak Rakaat
ur: رکعت ٹریکر

# app_slogan_tr
source: Enhancing Your Salah Experience, Rakaat by Rakaat
bn: আপনার সালাত অভিজ্ঞতাকে আরও উন্নত করুন, রাকাত দ্বারা রাকাত
hi: अपने नमाज़ अनुभव को बढ़ावा देना, रकात से रकात
id: Meningkatkan Pengalaman Shalatmu, Rakaat demi Rakaat
ur: اپنی نماز کی تجربہ کو بڑھانا, رکعت سے رکعت

# two_tr
source: Two
bn: দুই
hi: दो
id: Dua
ur: دو

# three_tr
source: Three
bn: তিন
hi: तीन
id: Tiga
ur: تین

# four_tr
source: Four
bn: চার
hi: चार
id: Empat
ur: چار

# taraweeh_tr
source: Taraweeh
bn: তারাবীহ
hi: तरावीह
id: Tarawih
ur: تراویح

# choose_tr
source: Choose rakaat to start
bn: শুরু করতে রাকাত বেছে নিন
hi: आरंभ करने के लिए रकात चुनें
id: Pilih rakaat untuk memulai
ur: شروع کرنے کے لیے رکعت کا انتخاب کریں

# sujood_tr
source: Sujood
bn: সুজূদ
hi: सुजूद
ur: سجدہ

# rakaat_tr
source: Rakaat
bn: রাকাত
hi: राकात
ur: رکعت

# msg_permission_not_granted_yet_tr
source: Location access not available yet
bn: অবস্থান অ্যাক্সেস এখনও উপলব্ধ নয়
hi: स्थान पहुँच अभी उपलब्ध नहीं है
id: Akses lokasi belum tersedia
ur: مقام تک رسائی ابھی تک دستیاب نہیں ہے

# msg_permission_granted_tr
source: Location Access Granted
bn: অবস্থান অ্যাক্সেস দেওয়া হয়েছে
hi: स्थान पहुँच प्रदान की गई
id: Akses Lokasi Diberikan
ur: مقام تک رسائی دی گئی

# msg_permission_required_tr
source: This app requires access to Location
bn: এই অ্যাপটির অবস্থানে অ্যাক্সেস প্রয়োজন
hi: इस ऐप को स्थान तक पहुँच की आवश्यकता है
id: Aplikasi ini memerlukan akses ke Lokasi
ur: اس ایپ کو مقام تک رسائی درکار ہے

# calibrate_tr
source: Wave the phone in a figure 8 motion to calibrate
bn: ক্যালিব্রেট করার জন্য ফোনটিকে 8 নম্বর মোশনে ঢেলে দিন
hi: कैलिब्रेट करने के लिए फ़ोन को 8 आकृति में घुमाएँ
id: Ayunkan ponsel dengan gerakan angka 8 untuk mengkalibrasi
ur: کیلیبریٹ کرنے کے لیے فون کو نمبر 8 کی حرکت میں لہرائیں

# calibrate_value_tr
source: Compass Accuracy:
bn: কম্পাস নির্ভুলতা:
hi: कम्पास शुद्धता:
id: Akurasi Kompas:
ur: کمپاس درستگی:

# low_tr
source: Low
bn: নিম্ন
hi: कम
id: Rendah
ur: کم

# medium_tr
source: Medium
bn: মাঝারি
hi: मीडियम
id: Sedang
ur: میڈیم

# high_tr
source: High
bn: উচ্চ
hi: हाई
id: Tinggi
ur: اعلی

# night_mode_tr
source: Night mode
bn: নাইট মোড
hi: रात मोड
id: Mode malam
ur: نائٹ موڈ

# vibration_tr
source: Vibration
bn: কম্পন
hi: कंपन
id: Getaran
ur: وائبریشن

# hide_sajda_tr
source: Hide Sajda Counter
bn: সেজদা কাউন্টার লুকান
hi: सजदा काउंटर छुपाएं
id: Sembunyikan Penghitung Sajda
ur: سجدہ کاؤنٹر چھپائیں

# sajda_interval_tr
source: Sajda Interval
bn: সেজদা বিরতি
hi: सजदा अंतराल
id: Sujud jarak waktu
ur: سجدہ وقفہ

# instructions_tr
source: Instructions
bn: নির্দেশ
id: Petunjuk
ur: ہدایات

# proxi_tr
source: ProxiSense
bn: প্রক্সিসেন্স
hi: प्रॉक्सीसेंस
ur: پراکسیسینس

# pocket_tr
source: PocketSense
bn: পকেটসেন্স
hi: पॉकेटसेंस
ur: پاکٹسینس

# important_tr
source: Important!
bn: গুরুত্বপূর্ণ!
hi: महत्वपूर्ण!
id: Penting!
ur: اہم!

# unavailable_tr
source: UNAVAILABLE
bn: অনুপলব্ধ
hi: अनुपलब्ध
id: TIDAK TERSEDIA
ur: غیر دستیاب

# new_tr
source: NEW
bn: নতুন
hi: नया
id: BARU
ur: نیا

# feature_un_tr
source: Feature unavailable
bn: বৈশিষ্ট্য অনুপলব্ধ
hi: सुविधा अनुपलब्ध
id: Fitur tidak tersedia
ur: فیچر دستیاب نہیں ہے

# mode_0_title_1_tr
source: Position your Device
bn: আপনার ডিভাইসের অবস্থান করুন
id: Posisikan Perangkat Anda
ur: اپنے آلے کو پوزیشن میں رکھیں

# mode_0_title_2_tr
source: Place your device below your neck
bn: আপনার ডিভাইস আপনার ঘাড়ের নীচে রাখুন
hi: अपना डिवाइस अपनी गर्दन के नीचे रखें
id: Letakkan perangkat di bawah leher Anda
ur: اپنے آلے کو اپنی گردن کے نیچے رکھیں

# mode_1_title_1_tr
source: Turn off and place your device in front pocket
bn: বন্ধ করুন এবং আপনার ডিভাইসটি সামনের পকেটে রাখুন
id: Matikan dan letakkan perangkat Anda di saku depan
ur: آف کر دیں اور اپنے آلے کو سامنے کی جیب میں رکھیں

# mode_1_title_2_tr
source: Press Power button to know the Rakaat
bn: রাকাত জানতে পাওয়ার বোতাম টিপুন
hi: रकात जानने के लिए पावर बटन दबाएँ
id: Tekan tombol Daya untuk mengetahui Rakaat
ur: رکعت جاننے کے لیے پاور بٹن دبائیں

# end_tr
source: END
bn: শেষ
hi: समाप्त
id: AKHIR
ur: ختم

# go_tr
source: GO
bn: যাও
hi: जाओ
id: PERGI
ur: جاؤ

# okay_tr
source: Okay
hi: ठीक है
ur: ٹھیک ہے

# mode_1_note_tr
source: Transition into sajda swiftly and rise slowly when getting up.
bn: সেজদায় দ্রুত রূপান্তর করুন এবং উঠার সময় ধীরে ধীরে উঠুন।
hi: तेजी से सजदा में प्रवेश करें और उठते समय धीरे-धीरे उठें।
id: Peralihan ke sajda dengan cepat dan naik perlahan saat bangun.
ur: سجدہ میں تیزی سے تبدیلی اور اٹھتے وقت آہستہ آہستہ اٹھیں۔

# mode_1_step1_tr
source: Select the desired number of rakaat for your prayer.
bn: আপনার নামাজের জন্য পছন্দসই রাকাত সংখ্যা নির্বাচন করুন।
hi: अपनी प्रार्थना के लिए रकअत की वांछित संख्या चुनें।
id: Pilih jumlah rakaat yang diinginkan untuk shalat Anda.
ur: اپنی نماز کے لیے مطلوبہ تعداد کا انتخاب کریں۔

# mode_1_step2_tr
source: Turn off the device by pressing the power button and securely place it in your front pocket. Avoid minimizing the app or pushing it into the background as it will cease to function. You have a 5-second window to complete this step.
bn: পাওয়ার বোতাম টিপে ডিভাইসটি বন্ধ করুন এবং এটিকে নিরাপদে আপনার সামনের পকেটে রাখুন। অ্যাপটিকে ছোট করা বা ব্যাকগ্রাউন্ডে ঠেলে দেওয়া এড়িয়ে চলুন কারণ এটি কাজ করা বন্ধ করে দেবে। এটি সম্পূর্ণ করার জন্য আপনার কাছে একটি 5-সেকেন্ডের উইন্ডো আছে পদক্ষেপ।
id: Matikan perangkat dengan menekan tombol daya dan letakkan dengan aman di saku depan Anda. Hindari meminimalkan aplikasi atau mendorongnya ke latar belakang karena akan berhenti berfungsi. Anda memiliki waktu 5 detik untuk menyelesaikan ini melangkah.
ur: پاور بٹن دبا کر ڈیوائس کو آف کریں اور اسے محفوظ طریقے سے اپنی اگلی جیب میں رکھیں۔ ایپ کو چھوٹا کرنے یا اسے پس منظر میں دھکیلنے سے گریز کریں کیونکہ یہ کام کرنا بند کر دے گی۔ اسے مکمل کرنے کے لیے آپ کے پاس 5 سیکنڈ کی ونڈو ہے۔ قدم

# mode_1_step3_tr
source: During prayer, if you wish to check the current rakat, simply press the power button without removing the device from your pocket. It will audibly announce the rakaat number.
bn: নামাজের সময়, আপনি যদি বর্তমান রাকাতটি পরীক্ষা করতে চান, তবে আপনার পকেট থেকে ডিভাইসটি না সরিয়ে কেবল পাওয়ার বোতামটি টিপুন। এটি শ্রবণে রাকাত সংখ্যা ঘোষণা করবে।
id: Selama sholat, jika Anda ingin memeriksa rakaat saat ini, cukup tekan tombol daya tanpa mengeluarkan perangkat dari saku Anda. Nomor rakaat akan diumumkan.
ur: نماز کے دوران, اگر آپ موجودہ رکعت کو چیک کرنا چاہتے ہیں, تو اپنی جیب سے ڈیوائس کو ہٹائے بغیر صرف پاور بٹن کو دبائیں, یہ رکعت کے نمبر کا اعلان کر دے گا۔

# mode_0_note_tr
source: Avoid looking at the device throughout the prayer and focus on your prayer instead, as the screen may sometimes be distracting.
bn: সারা প্রার্থনা জুড়ে ডিভাইসের দিকে তাকানো এড়িয়ে চলুন এবং পরিবর্তে আপনার প্রার্থনায় মনোযোগ দিন, কারণ স্ক্রিন কখনও কখনও বিভ্রান্তিকর হতে পারে।
hi: प्रार्थना के दौरान डिवाइस को देखने से बचें और इसके बजाय अपनी प्रार्थना पर ध्यान केंद्रित करें, क्योंकि स्क्रीन कभी-कभी ध्यान भटका सकती है।
id: Hindari melihat perangkat selama salat dan fokuslah pada salat Anda, karena layar terkadang mengganggu.
ur: پوری نماز کے دوران آلے کو دیکھنے سے گریز کریں اور اس کی بجائے اپنی نماز پر توجہ دیں, کیونکہ اسکرین بعض اوقات پریشان کن ہو سکتی ہے۔

# mode_0_step1_tr
source: Select the desired number of rakaat for your prayer.
bn: আপনার নামাজের জন্য পছন্দসই রাকাত সংখ্যা নির্বাচন করুন।
hi: अपनी प्रार्थना के लिए रकात की वांछित संख्या चुनें।
id: Pilih jumlah rakaat yang diinginkan untuk shalat Anda.
ur: اپنی نماز کے لیے مطلوبہ تعداد کا انتخاب کریں۔

# mode_0_step2_tr
source: Position the device on the floor or prayer mat directly below your sajda point, ensuring that it is facing forward.
bn: যন্ত্রটিকে মেঝেতে বা প্রার্থনার মাদুরে সরাসরি আপনার সাজদা পয়েন্টের নীচে রাখুন, নিশ্চিত করুন যে এটি সামনের দিকে রয়েছে।
id: Posisikan perangkat di lantai atau sajadah tepat di bawah titik sajda Anda, pastikan menghadap ke depan.
ur: آلہ کو فرش یا نماز کی چٹائی پر سیدھے اپنے سجدہ مقام کے نیچے رکھیں, اس بات کو یقینی بناتے ہوئے کہ یہ آگے کی طرف ہے۔

# mode_0_step3_tr
source: While going into sajda, ensure that your neck covers the device so that it can detect your presence. You can adjust its position slightly upwards towards your chin or downwards towards your chest. It's recommended to try this beforehand to remember the correct position.
bn: সেজদায় যাওয়ার সময়, নিশ্চিত করুন যে আপনার ঘাড় ডিভাইসটিকে ঢেকে রেখেছে যাতে এটি আপনার উপস্থিতি সনাক্ত করতে পারে। আপনি এটির অবস্থানটি আপনার চিবুকের দিকে সামান্য উপরে বা আপনার বুকের দিকে নীচের দিকে সামঞ্জস্য করতে পারেন। মনে রাখার জন্য এটি আগে থেকেই চেষ্টা করার পরামর্শ দেওয়া হচ্ছে। সঠিক অবস্থান।
id: Saat melakukan sajda, pastikan leher Anda menutupi perangkat agar dapat mendeteksi keberadaan Anda. Anda dapat menyesuaikan posisinya sedikit ke atas ke arah dagu atau ke bawah ke arah dada. Anda disarankan untuk mencobanya terlebih dahulu untuk mengingat posisi yang benar.
ur: سجدہ میں جاتے وقت, اس بات کو یقینی بنائیں کہ آپ کی گردن آلے کو ڈھانپ لے تاکہ وہ آپ کی موجودگی کا پتہ لگا سکے۔ آپ اس کی پوزیشن کو اپنی ٹھوڑی کی طرف یا نیچے کی طرف اپنے سینے کی طرف ایڈجسٹ کر سکتے ہیں۔ یہ یاد رکھنے کے لیے پہلے سے کوشش کرنے کی سفارش کی جاتی ہے۔ صحیح پوزیشن۔

# note_tr
source: Note
bn: দ্রষ্টব্য
hi: नोट
id: Catatan
ur: نوٹ

# step_tr
source: Step
bn: পদক্ষেপ
hi: कदम
id: Langkah
ur: مرحلہ

# mode_tr
source: Mode
bn: মোড
hi: मोड
ur: موڈ

# sense_tr
source: Sense
bn: সেন্স
hi: सेंस
ur: سینس

# proxi_heading_tr
source: Proxi
bn: প্রক্সি
hi: प्रॉक्सी
ur: پراکسی

# pocket_heading_tr
source: Pocket
bn: পকেট
hi: पॉकेट
ur: پاکٹ

# retry_tr
source: Retry
bn: পুনরায় চেষ্টা করুন
hi: पुनः प्रयास करें
id: Coba lagi
ur: دوبارہ کوشش کریں

# no_proximity_sensor_tr
source: No Proximity Sensor
bn: কোন প্রক্সিমিটি সেন্সর নেই
hi: कोई निकटता सेंसर नहीं
id: Tanpa Sensor Jarak
ur: کوئی قربت کا سینسر نہیں

# msg_no_proximity_sensor_tr
source: Unfortunately, your device doesn't support proximity sensor. This feature requires proximity sensor in order to work correctly.
bn: দুর্ভাগ্যবশত, আপনার ডিভাইসটি প্রক্সিমিটি সেন্সর সমর্থন করে না। এই বৈশিষ্ট্যটি সঠিকভাবে কাজ করার জন্য প্রক্সিমিটি সেন্সর প্রয়োজন।
hi: दुर्भाग्य से, आपका डिवाइस प्रॉक्सिमिटी सेंसर का समर्थन नहीं करता है। इस सुविधा को सही ढंग से काम करने के लिए प्रॉक्सिमिटी सेंसर की आवश्यकता है।
id: Sayangnya, perangkat Anda tidak mendukung sensor jarak. Fitur ini memerlukan sensor jarak agar berfungsi dengan benar.
ur: بدقسمتی سے, آپ کا آلہ قربت کے سینسر کو سپورٹ نہیں کرتا۔ اس فیچر کو درست طریقے سے کام کرنے کے لیے قربت کے سینسر کی ضرورت ہے۔

# no_compass_sensor_tr
source: No Compass Sensor
bn: কোনও কম্পাস সেন্সর নেই
hi: कोई कंपास सेंसर नहीं
id: Tidak Ada Sensor Kompas
ur: کوئی کمپاس سینسر نہیں

# msg_no_compass_sensor_tr
source: Unfortunately, your device doesn't support compass sensor. This feature requires compass sensor in order to work correctly.
bn: দুর্ভাগ্যবশত, আপনার ডিভাইস কম্পাস সেন্সর সমর্থন করে না। এই বৈশিষ্ট্যটি সঠিকভাবে কাজ করার জন্য কম্পাস সেন্সর প্রয়োজন।
hi: दुर्भाग्य से, आपका डिवाइस कंपास सेंसर का समर्थन नहीं करता है। इस सुविधा को सही ढंग से काम करने के लिए कंपास सेंसर की आवश्यकता है।
id: Sayangnya, perangkat Anda tidak mendukung sensor kompas. Fitur ini memerlukan sensor kompas agar berfungsi dengan benar.
ur: بدقسمتی سے, آپ کا آلہ کمپاس سینسر کو سپورٹ نہیں کرتا ہے۔ اس فیچر کو صحیح طریقے سے کام کرنے کے لیے کمپاس سینسر کی ضرورت ہے۔

# dont_show_again_tr
source: Don't Show Again
bn: আবার দেখাবেন না
hi: फिर मत दिखाओ
id: Jangan Tampilkan Lagi
ur: دوبارہ نہ دکھائیں

# update_app_tr
source: Update Required
bn: আপডেট প্রয়োজন
hi: अपडेट आवश्यक
id: Pembaruan Diperlukan
ur: اپ ڈیٹ کی ضرورت ہے

# msg_update_app_tr
source: Please update the app to continue using it. Thank you!
bn: অনুগ্রহ করে অ্যাপটি ব্যবহার চালিয়ে যেতে আপডেট করুন। ধন্যবাদ!
hi: कृपया ऐप का उपयोग जारी रखने के लिए इसे अपडेट करें। धन्यवाद!
id: Harap perbarui aplikasi untuk terus menggunakannya. Terima kasih!
ur: براہ کرم ایپ کا استعمال جاری رکھنے کے لیے اسے اپ ڈیٹ کریں۔ شکریہ!

# update_tr
source: Update
bn: আপডেট
hi: अद्यतन करें
id: Perbarui
ur: اپ ڈیٹ کریں

# skip_update_app_tr
source: Not now
bn: এখন নয়
hi: अभी नहीं
id: Jangan sekarang
ur: ابھی نہیں

# keep_device_pockets
source: Please place the device in your pocket
bn: দয়া করে আপনার জিবনে ডিভাইসটি রাখুন
hi: कृपया अपने जेब में डिवाइस रखें
id: Tolong letakkan perangkat di saku Anda
ur: براہ کرم اپنے جیب میں آلہ رکھیں۔

source: Start
bn: শুরু কর
hi: शुरू करें
id: Memulai
ur: شروع کریں
